<!-- dflook/terraform-github-actions {"workspace":"opentofu-2","backend_type":"remote","backend":"20523c8549388e56f0cba2c8323c8d7d9f3d6811f58409bfc1e32339ca7ae141","plan_job_ref":"Job Test Terraform cloud #176 at https://github.com/dflook/terraform-github-actions/actions/runs/6592484872","plan_hash":"4e8487d2f8075e43e047d193a3127d16b2be0acdea41b4130d75c0f85c72535d","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __opentofu-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #176](https://github.com/dflook/terraform-github-actions/actions/runs/6592484872)